Repository: SciViews/svAssert
Catalog: po/*.po
Languages: fr

source: {.arg {arg}} is not suitable.
fr: {.arg {arg}} ne convient pas.

source: Unknown type '%s' to specify check for names. Supported are 'unnamed', 'named', 'unique' and 'strict'.
fr: Type inconnu '%s' pour spécifier la vérification des noms. Les types pris en charge sont 'unnamed', 'named', 'unique' et 'strict'.

source: Unknown class identifier '%c'
fr: Identifiant de classe inconnu ‘%c'

source: Timezones of 'x' and 'upper' must match
fr: Les fuseaux horaires de 'x' et 'upper' doivent correspondre.

source: Timezones of 'x' and 'lower' must match
fr: Les fuseaux horaires de 'x' et 'lower' doivent correspondre.

source: Rule may not be NA
fr: La règle peut ne pas être NA

source: Must store numerics
fr: Doit stocker des nombres

source: Must store logicals
fr: Doit stocker des valeurs logiques

source: Must store integers
fr: Doit stocker des entiers

source: Must store integerish values
fr: Doit stocker des nombres convertibles en entiers

source: Must store doubles
fr: Doit stocker des nombres doubles

source: Must store complexs
fr: Doit stocker des nombres complexes

source: Must store characters
fr: Doit stocker des chaînes de caractères

source: Must store a list
fr: Doit stocker une liste

source: Must have unique %s, but element %i is duplicated
fr: Doit avoir un %s unique, mais l'élément %i est dupliqué.

source: Must have length 1
fr: Longueur 1 requise

source: Must have length >= %g, but has length %g
fr: La longueur doit être >= %g, mais elle est %g.

source: Must have length <= %g, but has length %g
fr: La longueur doit être <= %g, mais elle est %g.

source: Must have length %g, but has length %g
fr: Doit avoir une longueur %g, mais a une longueur %g

source: Must have exactly %i rows, but has %i rows
fr: Doit comporter exactement %i lignes, mais en comporte %i.

source: Must have exactly %i cols, but has %i cols
fr: Doit avoir exactement %i colonnes, mais en a %i.

source: Must have at most %i rows, but has %i rows
fr: Doit avoir au maximum %i lignes, mais en a %i.

source: Must have at most %i cols, but has %i cols
fr: Doit avoir au maximum %i colonnes, mais en a %i.

source: Must have at least %i rows, but has %i rows
fr: Doit comporter au moins %i lignes, mais en comporte %i.

source: Must have at least %i cols, but has %i cols
fr: Doit avoir au moins %i colonnes, mais en a %i.

source: Must have >=%i dimensions, but has dimension %i
fr: Doit avoir >=%i dimensions, mais a une dimension %i

source: Must have <=%i dimensions, but has dimension %i
fr: Doit avoir <=%i dimensions, mais a la dimension %i

source: Must have %s, but is NA at position %i
fr: Doit avoir %s, mais est NA à la position %i

source: Must have %s, but element %i is empty
fr: Doit contenir %s, mais l'élément %i est vide.

source: Must have %s according to R's variable naming conventions, but element %i does not comply
fr: Doit avoir %s selon les conventions de nommage des variables de R, mais l'élément %i n'est pas conforme.

source: Must have %s
fr: Doit avoir %s

source: Must be sorted
fr: Doit être trié

source: Must be of type 'integerish'%s, not '%s'
fr: Doit être de type 'integerish'%s, et non '%s'.

source: Must be of type 'integerish', not 'NULL'
fr: Doit être de type 'integerish', et non 'NULL'.

source: Must be of type 'integerish', but element %g is not in integer range
fr: Doit être de type integerish', mais l'élément %g n'est pas dans la plage des entiers.

source: Must be of type 'integerish', but element %g is not close to an integer
fr: Doit être de type integerish', mais l'élément %g n'est pas proche d'un entier.

source: Must be of type 'integerish', but element %g has an imaginary part
fr: Doit être de type integerish', mais l'élément %g comporte une partie imaginaire.

source: Must be of type '%s'%s, not '%s'
fr: Doit être de type '%s'%s, et non '%s'.

source: Must be of type '%s', not 'NULL'
fr: Doit être de type '%s', et non 'NULL'.

source: Must be of type '%s', not '%s'
fr: Doit être de type '%s', et non '%s'.

source: Must be of length %s %i, but has length %g
fr: Doit avoir une longueur %s %i, mais a une longueur de %g.

source: Must be of class '%s', not '%s'
fr: Doit être de classe '%s', et non '%s'.

source: Must be finite
fr: Doit être fini

source: Must be atomic
fr: Doit être atomique

source: Must be a character vector
fr: Doit être un vecteur de chaînes de caractères

source: Must be a %i-d array, but has dimension %i
fr: Doit être un tableau (array) de %i dimensions, mais a une dimension %i

source: Must be >= %i
fr: Doit être >= %i

source: May not have %s
fr: Ne peut pas avoir %s

source: May not contain missing values, first at position %i
fr: Ne peut contenir de valeurs manquantes, la première à la position %i

source: May not contain missing values, first at column %i, element %i
fr: Ne peut pas contenir de valeurs manquantes, la première est dans la colonne %i, élément %i

source: May not contain missing values, first at column '%s', element %i
fr: Ne peut pas contenir de valeurs manquantes, la première est dans la colonne '%s', élément %i

source: May not be NA
fr: Peut ne pas être NA

source: Invalid length definition: %s
fr: Définition de longueur non valide : %s

source: Invalid bound definition, missing opening '(' or '[': %s
fr: Définition de limite non valide, '(' ou '[' manquant au début : %s

source: Invalid bound definition, error parsing upper bound or missing closing ')' or ']': %s
fr: Définition de limite invalide, erreur d’interprétation de la limite supérieure ou bien ')' ou ']' manquant à la fin : %s

source: Invalid bound definition, error parsing lower bound, missing separator ',' or missing closing ')' or ']': %s
fr: Définition de limite non valide, erreur d’interprétation de la limite inférieure, séparateur ',' manquant ou caractère de fin ')' ou ']' manquant : %s

source: Invalid argument 'mode'. Must be one of 'logical', 'integer', 'integerish', 'double', 'numeric', 'complex', 'character', 'list' or 'atomic'
fr: Argument mode incorrect. Doit être l'un des options suivantes : 'logical’, 'integer', 'integerish', 'double', 'numeric', 'complex', 'character', 'list' ou 'atomic'

source: Empty rule
fr: Règle vide

source: Element %i is not >= %s
fr: L'élément %i n'est pas >= %s

source: Element %i is not >= %g
fr: L'élément %i n'est pas >= %g

source: Element %i is not <= %s
fr: L'élément %i n'est pas <= %s

source: Element %i is not <= %g
fr: L'élément %i n'est pas <= %g

source: Contains only missing values
fr: Contient seulement des valeurs manquantes

source: Contains missing values (row %i, col %i)
fr: Contient des valeurs manquantes (ligne %i, colonne %i)

source: Contains missing values (element %i)
fr: Contient des valeurs manquantes (élément %i)

source: Contains missing values (column '%s', row %i)
fr: Contient des valeurs manquantes (colonne '%s', ligne %i)

source: Contains missing values
fr: Contient des valeurs manquantes

source: Contains duplicated values, position %i
fr: Contient des valeurs en double à la position %i

source: Cannot handle length >= %i
fr: Impossible de traiter une longueur >= %i

source: Cannot check for negative length
fr: Impossible de vérifier une longueur négative

source: Bound checks only possible for numeric variables, strings and factors, not %s
fr: Les vérifications de limites ne sont possibles que pour les variables numériques, les chaînes de caractères et les variables 'factor', pas pour %s.

source: Argument 'x' must be a list or data.frame
fr: L'argument 'x' doit être une liste ou un data.frame.

source: Argument 'upper' must be provided as single POSIXct time
fr: L'argument 'upper' doit être fourni sous la forme d'un seul temps 'POSIXct'.

source: Argument 'rules' must be a string
fr: L’argument rules' doivent être une chaîne de caractères

source: Argument 'lower' must be provided as single POSIXct time
fr: L'argument 'lower' doit être fourni sous la forme d'un seul temps 'POSIXct'.

source: All elements must have exactly %i characters, but element %i has %i chararacters
fr: Tous les éléments doivent comporter exactement %i caractères, mais l'élément %i en comporte %i.

source: All elements must have at most %i characters, but element %i has %i characters
fr: Tous les éléments doivent comporter au maximum %i caractères, mais l'élément %i en comporte %i.

source: All elements must have at least %i characters, but element %i has %i characters
fr: Tous les éléments doivent comporter au moins %i caractères, mais l'élément %i en comporte %i.

source: All elements must have %s %g chars
fr: Tous les éléments doivent comporter %s %g caractères.

source: All elements must be %s Inf
fr: Tous les éléments doivent être %s Inf

source: All elements must be %s %g
fr: Tous les éléments doivent être %s %g

source: All elements must be %s -Inf
fr: Tous les éléments doivent être %s -Inf

source: Additional chars found in rule!
fr: Caractères supplémentaires trouvés dans la règle !

source: {.emph The data-dot mechanism was likely activated}
fr: {.emph Le mécanisme « data-dot » a été probablement activé}

source: (see {.help svBase::data_dot_mechanism}).
fr: (voir {.help svBase::data_dot_mechanism}).

source: {.emph {.code .} is {object_info(.)}}
fr: {.emph {.code .} est {object_info(.)}}

source: a data frame with %d rows and %d columns: %s
fr: un data frame avec %d lignes et %d colonnes : %s

source: a list with %d elements
fr: une liste avec %d éléments

source: a vector of type '%s' and %d elements
fr: un vecteur de type '%s' et %d éléments

source: an object of class '%s'
fr: un objet de classe '%s'

source: The provided check_function does not seem to be a checkmate check_ function.
fr: La fonction 'check_xxx()' fournie ne semble pas être une fonction checkmate.
